back-end/app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "name", "location", "bio", "resource_request", "skills", "seeking", "preferred_contact", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    user = User.new(user_params)
    if user.save